tut08/sol08.org
#+title: Lösungen zum 8. Übungsblatt
#+date: 2018-06-15
#+email: tobias.denkinger@tu-dresden.de
#+options: toc:nil

* Lösung zu Aufgabe 1
** Teilaufgabe a

#+begin_src prolog
nat(0).                              % 1
nat(s(X)) :- nat(X).                 % 2

sum(0, M, M) :- nat(M).              % 4
sum(s(M), N, s(L)) :- sum(M, N, L).  % 5

lt(0, s(X)) :- nat(X).               % 7
lt(s(X), s(Y)) :- lt(X, Y).          % 8

div(0, M, 0) :- lt(0, M).            % 10, weglassen?
div(N, M, 0) :- lt(N, M).            % 11
div(N, M, s(Q)) :- lt(0, M), sum(M, V, N), div(V, M, Q).  % 12
#+end_src

** Teilaufgabe b

#+begin_src prolog
          ?- div(<3>, <2>, <1>).
          ?- lt(0, <2>), sum(<2>, V, <3>), div(V, <2>, 0).   % 12
          ?- nat(<1>), sum(<2>, V, <3>), div(V, <2>, 0).     % 7
          ?- nat(0), sum(<2>, V, <3>), div(V, <2>, 0).       % 2
          ?- sum(<2>, V, <3>), div(V, <2>, 0).               % 1
          ?-* sum(0, V, <1>), div(V, <2>, 0).                % 5
{V = <1>} ?- div(<1>, <2>, 0).                               % 4
          ?- lt(<1>, <2>).                                   % 11
          ?- lt(0, <1>).                                     % 8
          ?- nat(0).                                         % 7
          ?-.                                                % 1
#+end_src

* Lösung zu Aufgabe 2 (AGS 14.1)
** Teilaufgabe a

#+begin_src
trans(#include <stdio.h> int main() {…})
= blocktrans(int a, b, max; … return 0;)
= stseqtrans(scanf(…);…;printf(…);  ,  update(int a, b, max; , []), 1)
= stseqtrans(scanf(…);…;printf(…);  ,  [a/(var, 1), b/(var, 2), max/(var, 3)], 1)
                                       --------------------------------------
                                                   =: tab
= sttrans(scanf("%i", &a);, tab, 1.1)
  sttrans(scanf("%i", &b);, tab, 1.2)
  sttrans(if (a > b) max = a; else max = b;, tab, 1.3)
  sttrans(printf("%d", max);, tab, 1.4)

= 1.1:       READ 1;
  1.2:       READ 2;
  1.3:       LOAD 1; LOAD 2; GT; JMC 1.3.1
  1.3.2:     LOAD 1; STORE 3; JMP 1.3.3;
  1.3.1:     LOAD 2; STORE 3;
  1.3.3:
  1.4:       WRITE 3;
#+end_src

** Teilaufgabe b

#+begin_src
1: READ 1;   4: LOAD 2;   7: LOAD 1;    10: LOAD 2;
2: READ 2;   5: GT;       8: STORE 3;   11: STORE 3;
3: LOAD 1;   6: JMC 10;   9: JMP 12;    12: WRITE 3;
#+end_src

* Lösung zu Aufgabe 3 (AGS 14.10)
** Teilaufgabe a

#+begin_src
1: READ 2;   4: STORE 1;  7: LT;       10: LIT 1;    13: LOAD 2;   16: JMP 9;
2: READ 3;   5: LOAD 1;   8: JMC 17;   11: ADD;      14: LOAD 2;   17: WRITE 2;
3: LIT 0;    6: LOAD 3;   9: LOAD 1;   12: STORE 1;  15: MUL;
#+end_src

** Teilaufgabe b

| BZ |    DK | HS         |  In | Out |          |
|    |   <r> | <l>        | <r> | <l> |          |
|----+-------+------------+-----+-----+----------|
|  1 |     ε | []         | 0:1 | ε   | READ 1;  |
|  2 |       | [1/0]      |   1 | ε   | READ 2;  |
|  3 |       | [1/0, 2/1] |   ε |     | LOAD 1;  |
|  4 |     0 |            |     |     | LOAD 2;  |
|  5 |   1:0 |            |     |     | LIT 0;   |
|  6 | 0:1:0 |            |     |     | SUB;     |
|  7 |   1:0 |            |     |     | JMC 9;   |
|  8 |     0 |            |     |     | JMP 5;   |
|  5 |       |            |     |     | LIT 0;   |
|  6 |   0:0 |            |     |     | SUB;     |
|  7 |     0 |            |     |     | JMC 9;   |
|  9 |     ε |            |     |     | WRITE 2; |
| 10 |       |            |     | 1   |          |

* Lösung zu Aufgabe 4 (AGS 15.18 b)

| BZ |  DK | LK           | REF | In | Out |                   |
|    | <r> | <l>          |     |    |     |                   |
|----+-----+--------------+-----+----+-----+-------------------|
| 14 |   ε | 0:0:1        |   3 | 4  | ε   | READ(global, 1);  |
| 15 |     | 4:0:1        |     | ε  |     | LOADA(global, 1); |
| 16 |   1 |              |     |    |     | PUSH;             |
| 17 |   ε | 4:0:1:1      |     |    |     | CALL 3;           |
|  3 |     | 4:0:1:1:18:3 |   6 |    |     | INIT 0;           |
|  4 |     |              |     |    |     | LOADI(-2);        |
|  5 |   4 |              |     |    |     | LIT 2;            |
|  6 | 2:4 |              |     |    |     | GT;               |
|  7 |   1 |              |     |    |     | JMC 12;           |
|  8 |   ε |              |     |    |     | LOADI(-2);        |
|  9 |   4 |              |     |    |     | LIT 2;            |
| 10 | 2:4 |              |     |    |     | DIV;              |
| 11 |   2 |              |     |    |     | STOREI(-2);       |
| 12 |   ε | 2:0:1:1:18:3 |     |    |     | RET 1;            |
| 18 |     | 2:0:1        |   3 |    |     | WRITE(global, 1); |
| 19 |     |              |     |    | 2   | JMP 0;            |
| 0  |     |              |     |    |     |                   |
