tut08/sol08.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-06-21 Do 08:23 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Lösungen zum 8. Übungsblatt</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Tobias Denkinger" />
</head>
<body>
<div id="content">
<h1 class="title">Lösungen zum 8. Übungsblatt</h1>

<div id="outline-container-orgf6918b6" class="outline-2">
<h2 id="orgf6918b6"><span class="section-number-2">1</span> Lösung zu Aufgabe 1</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org8f70fe9" class="outline-3">
<h3 id="org8f70fe9"><span class="section-number-3">1.1</span> Teilaufgabe a</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">
<pre class="src src-prolog"><span style="color: #268bd2;">nat</span><span style="color: #2aa198;">(</span><span style="color: #6c71c4;">0</span><span style="color: #2aa198;">)</span>.                              <span style="color: #93a1a1;">% </span><span style="color: #93a1a1;">1</span>
<span style="color: #268bd2;">nat</span><span style="color: #2aa198;">(</span>s<span style="color: #b58900;">(</span><span style="color: #268bd2;">X</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span> :- nat<span style="color: #2aa198;">(</span><span style="color: #268bd2;">X</span><span style="color: #2aa198;">)</span>.                 <span style="color: #93a1a1;">% </span><span style="color: #93a1a1;">2</span>

<span style="color: #268bd2;">sum</span><span style="color: #2aa198;">(</span><span style="color: #6c71c4;">0</span>, <span style="color: #268bd2;">M</span>, <span style="color: #268bd2;">M</span><span style="color: #2aa198;">)</span> :- nat<span style="color: #2aa198;">(</span><span style="color: #268bd2;">M</span><span style="color: #2aa198;">)</span>.              <span style="color: #93a1a1;">% </span><span style="color: #93a1a1;">4</span>
<span style="color: #268bd2;">sum</span><span style="color: #2aa198;">(</span>s<span style="color: #b58900;">(</span><span style="color: #268bd2;">M</span><span style="color: #b58900;">)</span>, <span style="color: #268bd2;">N</span>, s<span style="color: #b58900;">(</span><span style="color: #268bd2;">L</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span> :- sum<span style="color: #2aa198;">(</span><span style="color: #268bd2;">M</span>, <span style="color: #268bd2;">N</span>, <span style="color: #268bd2;">L</span><span style="color: #2aa198;">)</span>.  <span style="color: #93a1a1;">% </span><span style="color: #93a1a1;">5</span>

<span style="color: #268bd2;">lt</span><span style="color: #2aa198;">(</span><span style="color: #6c71c4;">0</span>, s<span style="color: #b58900;">(</span><span style="color: #268bd2;">X</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span> :- nat<span style="color: #2aa198;">(</span><span style="color: #268bd2;">X</span><span style="color: #2aa198;">)</span>.               <span style="color: #93a1a1;">% </span><span style="color: #93a1a1;">7</span>
<span style="color: #268bd2;">lt</span><span style="color: #2aa198;">(</span>s<span style="color: #b58900;">(</span><span style="color: #268bd2;">X</span><span style="color: #b58900;">)</span>, s<span style="color: #b58900;">(</span><span style="color: #268bd2;">Y</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span> :- lt<span style="color: #2aa198;">(</span><span style="color: #268bd2;">X</span>, <span style="color: #268bd2;">Y</span><span style="color: #2aa198;">)</span>.          <span style="color: #93a1a1;">% </span><span style="color: #93a1a1;">8</span>

<span style="color: #268bd2;">div</span><span style="color: #2aa198;">(</span><span style="color: #6c71c4;">0</span>, <span style="color: #268bd2;">M</span>, <span style="color: #6c71c4;">0</span><span style="color: #2aa198;">)</span> :- lt<span style="color: #2aa198;">(</span><span style="color: #6c71c4;">0</span>, <span style="color: #268bd2;">M</span><span style="color: #2aa198;">)</span>.            <span style="color: #93a1a1;">% </span><span style="color: #93a1a1;">10, weglassen?</span>
<span style="color: #268bd2;">div</span><span style="color: #2aa198;">(</span><span style="color: #268bd2;">N</span>, <span style="color: #268bd2;">M</span>, <span style="color: #6c71c4;">0</span><span style="color: #2aa198;">)</span> :- lt<span style="color: #2aa198;">(</span><span style="color: #268bd2;">N</span>, <span style="color: #268bd2;">M</span><span style="color: #2aa198;">)</span>.            <span style="color: #93a1a1;">% </span><span style="color: #93a1a1;">11</span>
<span style="color: #268bd2;">div</span><span style="color: #2aa198;">(</span><span style="color: #268bd2;">N</span>, <span style="color: #268bd2;">M</span>, s<span style="color: #b58900;">(</span><span style="color: #268bd2;">Q</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span> :- lt<span style="color: #2aa198;">(</span><span style="color: #6c71c4;">0</span>, <span style="color: #268bd2;">M</span><span style="color: #2aa198;">)</span>, sum<span style="color: #2aa198;">(</span><span style="color: #268bd2;">M</span>, <span style="color: #268bd2;">V</span>, <span style="color: #268bd2;">N</span><span style="color: #2aa198;">)</span>, div<span style="color: #2aa198;">(</span><span style="color: #268bd2;">V</span>, <span style="color: #268bd2;">M</span>, <span style="color: #268bd2;">Q</span><span style="color: #2aa198;">)</span>.  <span style="color: #93a1a1;">% </span><span style="color: #93a1a1;">12</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org52d88f7" class="outline-3">
<h3 id="org52d88f7"><span class="section-number-3">1.2</span> Teilaufgabe b</h3>
<div class="outline-text-3" id="text-1-2">
<div class="org-src-container">
<pre class="src src-prolog">          ?- div<span style="color: #2aa198;">(</span>&lt;<span style="color: #6c71c4;">3</span>&gt;, &lt;<span style="color: #6c71c4;">2</span>&gt;, &lt;<span style="color: #6c71c4;">1</span>&gt;<span style="color: #2aa198;">)</span>.
          ?- lt<span style="color: #2aa198;">(</span><span style="color: #6c71c4;">0</span>, &lt;<span style="color: #6c71c4;">2</span>&gt;<span style="color: #2aa198;">)</span>, sum<span style="color: #2aa198;">(</span>&lt;<span style="color: #6c71c4;">2</span>&gt;, <span style="color: #268bd2;">V</span>, &lt;<span style="color: #6c71c4;">3</span>&gt;<span style="color: #2aa198;">)</span>, div<span style="color: #2aa198;">(</span><span style="color: #268bd2;">V</span>, &lt;<span style="color: #6c71c4;">2</span>&gt;, <span style="color: #6c71c4;">0</span><span style="color: #2aa198;">)</span>.   <span style="color: #93a1a1;">% </span><span style="color: #93a1a1;">12</span>
          ?- nat<span style="color: #2aa198;">(</span>&lt;<span style="color: #6c71c4;">1</span>&gt;<span style="color: #2aa198;">)</span>, sum<span style="color: #2aa198;">(</span>&lt;<span style="color: #6c71c4;">2</span>&gt;, <span style="color: #268bd2;">V</span>, &lt;<span style="color: #6c71c4;">3</span>&gt;<span style="color: #2aa198;">)</span>, div<span style="color: #2aa198;">(</span><span style="color: #268bd2;">V</span>, &lt;<span style="color: #6c71c4;">2</span>&gt;, <span style="color: #6c71c4;">0</span><span style="color: #2aa198;">)</span>.     <span style="color: #93a1a1;">% </span><span style="color: #93a1a1;">7</span>
          ?- nat<span style="color: #2aa198;">(</span><span style="color: #6c71c4;">0</span><span style="color: #2aa198;">)</span>, sum<span style="color: #2aa198;">(</span>&lt;<span style="color: #6c71c4;">2</span>&gt;, <span style="color: #268bd2;">V</span>, &lt;<span style="color: #6c71c4;">3</span>&gt;<span style="color: #2aa198;">)</span>, div<span style="color: #2aa198;">(</span><span style="color: #268bd2;">V</span>, &lt;<span style="color: #6c71c4;">2</span>&gt;, <span style="color: #6c71c4;">0</span><span style="color: #2aa198;">)</span>.       <span style="color: #93a1a1;">% </span><span style="color: #93a1a1;">2</span>
          ?- sum<span style="color: #2aa198;">(</span>&lt;<span style="color: #6c71c4;">2</span>&gt;, <span style="color: #268bd2;">V</span>, &lt;<span style="color: #6c71c4;">3</span>&gt;<span style="color: #2aa198;">)</span>, div<span style="color: #2aa198;">(</span><span style="color: #268bd2;">V</span>, &lt;<span style="color: #6c71c4;">2</span>&gt;, <span style="color: #6c71c4;">0</span><span style="color: #2aa198;">)</span>.               <span style="color: #93a1a1;">% </span><span style="color: #93a1a1;">1</span>
          ?-* sum<span style="color: #2aa198;">(</span><span style="color: #6c71c4;">0</span>, <span style="color: #268bd2;">V</span>, &lt;<span style="color: #6c71c4;">1</span>&gt;<span style="color: #2aa198;">)</span>, div<span style="color: #2aa198;">(</span><span style="color: #268bd2;">V</span>, &lt;<span style="color: #6c71c4;">2</span>&gt;, <span style="color: #6c71c4;">0</span><span style="color: #2aa198;">)</span>.                <span style="color: #93a1a1;">% </span><span style="color: #93a1a1;">5</span>
<span style="color: #2aa198; font-weight: bold;">{</span><span style="color: #268bd2;">V</span> = &lt;<span style="color: #6c71c4;">1</span>&gt;<span style="color: #2aa198; font-weight: bold;">}</span> ?- div<span style="color: #2aa198;">(</span>&lt;<span style="color: #6c71c4;">1</span>&gt;, &lt;<span style="color: #6c71c4;">2</span>&gt;, <span style="color: #6c71c4;">0</span><span style="color: #2aa198;">)</span>.                               <span style="color: #93a1a1;">% </span><span style="color: #93a1a1;">4</span>
          ?- lt<span style="color: #2aa198;">(</span>&lt;<span style="color: #6c71c4;">1</span>&gt;, &lt;<span style="color: #6c71c4;">2</span>&gt;<span style="color: #2aa198;">)</span>.                                   <span style="color: #93a1a1;">% </span><span style="color: #93a1a1;">11</span>
          ?- lt<span style="color: #2aa198;">(</span><span style="color: #6c71c4;">0</span>, &lt;<span style="color: #6c71c4;">1</span>&gt;<span style="color: #2aa198;">)</span>.                                     <span style="color: #93a1a1;">% </span><span style="color: #93a1a1;">8</span>
          ?- nat<span style="color: #2aa198;">(</span><span style="color: #6c71c4;">0</span><span style="color: #2aa198;">)</span>.                                         <span style="color: #93a1a1;">% </span><span style="color: #93a1a1;">7</span>
          ?-.                                                <span style="color: #93a1a1;">% </span><span style="color: #93a1a1;">1</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgd3d9a25" class="outline-2">
<h2 id="orgd3d9a25"><span class="section-number-2">2</span> Lösung zu Aufgabe 2 (AGS 14.1)</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org6426420" class="outline-3">
<h3 id="org6426420"><span class="section-number-3">2.1</span> Teilaufgabe a</h3>
<div class="outline-text-3" id="text-2-1">
<pre class="example">
trans(#include &lt;stdio.h&gt; int main() {…})
= blocktrans(int a, b, max; … return 0;)
= stseqtrans(scanf(…);…;printf(…);  ,  update(int a, b, max; , []), 1)
= stseqtrans(scanf(…);…;printf(…);  ,  [a/(var, 1), b/(var, 2), max/(var, 3)], 1)
                                       --------------------------------------
                                                   =: tab
= sttrans(scanf("%i", &amp;a);, tab, 1.1)
  sttrans(scanf("%i", &amp;b);, tab, 1.2)
  sttrans(if (a &gt; b) max = a; else max = b;, tab, 1.3)
  sttrans(printf("%d", max);, tab, 1.4)

= 1.1:       READ 1;
  1.2:       READ 2;
  1.3:       LOAD 1; LOAD 2; GT; JMC 1.3.1
  1.3.2:     LOAD 1; STORE 3; JMP 1.3.3;
  1.3.1:     LOAD 2; STORE 3;
  1.3.3:
  1.4:       WRITE 3;
</pre>
</div>
</div>

<div id="outline-container-org5eb4bf0" class="outline-3">
<h3 id="org5eb4bf0"><span class="section-number-3">2.2</span> Teilaufgabe b</h3>
<div class="outline-text-3" id="text-2-2">
<pre class="example">
1: READ 1;   4: LOAD 2;   7: LOAD 1;    10: LOAD 2;
2: READ 2;   5: GT;       8: STORE 3;   11: STORE 3;
3: LOAD 1;   6: JMC 10;   9: JMP 12;    12: WRITE 3;
</pre>
</div>
</div>
</div>

<div id="outline-container-orgdc29375" class="outline-2">
<h2 id="orgdc29375"><span class="section-number-2">3</span> Lösung zu Aufgabe 3 (AGS 14.10)</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org105026a" class="outline-3">
<h3 id="org105026a"><span class="section-number-3">3.1</span> Teilaufgabe a</h3>
<div class="outline-text-3" id="text-3-1">
<pre class="example">
1: READ 2;   4: STORE 1;  7: LT;       10: LIT 1;    13: LOAD 2;   16: JMP 5;
2: READ 3;   5: LOAD 1;   8: JMC 17;   11: ADD;      14: LOAD 2;   17: WRITE 2;
3: LIT 0;    6: LOAD 3;   9: LOAD 1;   12: STORE 1;  15: MUL;
</pre>
</div>
</div>

<div id="outline-container-orgec00c5e" class="outline-3">
<h3 id="orgec00c5e"><span class="section-number-3">3.2</span> Teilaufgabe b</h3>
<div class="outline-text-3" id="text-3-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">BZ</th>
<th scope="col" class="org-right">DK</th>
<th scope="col" class="org-left">HS</th>
<th scope="col" class="org-right">In</th>
<th scope="col" class="org-left">Out</th>
<th scope="col" class="org-left">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">1</td>
<td class="org-right">ε</td>
<td class="org-left">[]</td>
<td class="org-right">0:1</td>
<td class="org-left">ε</td>
<td class="org-left">READ 1;</td>
</tr>

<tr>
<td class="org-right">2</td>
<td class="org-right">&#xa0;</td>
<td class="org-left">[1/0]</td>
<td class="org-right">1</td>
<td class="org-left">ε</td>
<td class="org-left">READ 2;</td>
</tr>

<tr>
<td class="org-right">3</td>
<td class="org-right">&#xa0;</td>
<td class="org-left">[1/0, 2/1]</td>
<td class="org-right">ε</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">LOAD 1;</td>
</tr>

<tr>
<td class="org-right">4</td>
<td class="org-right">0</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">LOAD 2;</td>
</tr>

<tr>
<td class="org-right">5</td>
<td class="org-right">1:0</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">LIT 0;</td>
</tr>

<tr>
<td class="org-right">6</td>
<td class="org-right">0:1:0</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">SUB;</td>
</tr>

<tr>
<td class="org-right">7</td>
<td class="org-right">1:0</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">JMC 9;</td>
</tr>

<tr>
<td class="org-right">8</td>
<td class="org-right">0</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">JMP 5;</td>
</tr>

<tr>
<td class="org-right">5</td>
<td class="org-right">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">LIT 0;</td>
</tr>

<tr>
<td class="org-right">6</td>
<td class="org-right">0:0</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">SUB;</td>
</tr>

<tr>
<td class="org-right">7</td>
<td class="org-right">0</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">JMC 9;</td>
</tr>

<tr>
<td class="org-right">9</td>
<td class="org-right">ε</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">WRITE 2;</td>
</tr>

<tr>
<td class="org-right">10</td>
<td class="org-right">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-left">1</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>

<div id="outline-container-org98902dd" class="outline-2">
<h2 id="org98902dd"><span class="section-number-2">4</span> Lösung zu Aufgabe 4 (AGS 15.18 b)</h2>
<div class="outline-text-2" id="text-4">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">BZ</th>
<th scope="col" class="org-right">DK</th>
<th scope="col" class="org-left">LK</th>
<th scope="col" class="org-right">REF</th>
<th scope="col" class="org-left">In</th>
<th scope="col" class="org-left">Out</th>
<th scope="col" class="org-left">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">14</td>
<td class="org-right">ε</td>
<td class="org-left">0:0:1</td>
<td class="org-right">3</td>
<td class="org-left">4</td>
<td class="org-left">ε</td>
<td class="org-left">READ(global, 1);</td>
</tr>

<tr>
<td class="org-right">15</td>
<td class="org-right">&#xa0;</td>
<td class="org-left">4:0:1</td>
<td class="org-right">&#xa0;</td>
<td class="org-left">ε</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">LOADA(global, 1);</td>
</tr>

<tr>
<td class="org-right">16</td>
<td class="org-right">1</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">PUSH;</td>
</tr>

<tr>
<td class="org-right">17</td>
<td class="org-right">ε</td>
<td class="org-left">4:0:1:1</td>
<td class="org-right">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">CALL 3;</td>
</tr>

<tr>
<td class="org-right">3</td>
<td class="org-right">&#xa0;</td>
<td class="org-left">4:0:1:1:18:3</td>
<td class="org-right">6</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">INIT 0;</td>
</tr>

<tr>
<td class="org-right">4</td>
<td class="org-right">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">LOADI(-2);</td>
</tr>

<tr>
<td class="org-right">5</td>
<td class="org-right">4</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">LIT 2;</td>
</tr>

<tr>
<td class="org-right">6</td>
<td class="org-right">2:4</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">GT;</td>
</tr>

<tr>
<td class="org-right">7</td>
<td class="org-right">1</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">JMC 12;</td>
</tr>

<tr>
<td class="org-right">8</td>
<td class="org-right">ε</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">LOADI(-2);</td>
</tr>

<tr>
<td class="org-right">9</td>
<td class="org-right">4</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">LIT 2;</td>
</tr>

<tr>
<td class="org-right">10</td>
<td class="org-right">2:4</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">DIV;</td>
</tr>

<tr>
<td class="org-right">11</td>
<td class="org-right">2</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">STOREI(-2);</td>
</tr>

<tr>
<td class="org-right">12</td>
<td class="org-right">ε</td>
<td class="org-left">2:0:1:1:18:3</td>
<td class="org-right">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">RET 1;</td>
</tr>

<tr>
<td class="org-right">18</td>
<td class="org-right">&#xa0;</td>
<td class="org-left">2:0:1</td>
<td class="org-right">3</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">WRITE(global, 1);</td>
</tr>

<tr>
<td class="org-right">19</td>
<td class="org-right">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">2</td>
<td class="org-left">JMP 0;</td>
</tr>

<tr>
<td class="org-right">0</td>
<td class="org-right">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2018-06-13</p>
<p class="author">Author: Tobias Denkinger</p>
<p class="date">Created: 2018-06-21 Do 08:23</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
